#### DeleteWorksetSettings Members

---

|  |
| --- |
| DeleteWorksetSettings Class   Constructors   Methods   Properties   See Also |

The  DeleteWorksetSettings  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | DeleteWorksetSettings | Constructs a DeleteWorksetSettings object with DeleteWorksetOption::DeleteAllElements option. |
| Public method | DeleteWorksetSettings(DeleteWorksetOption, WorksetId) | Constructs a DeleteWorksetSettings object. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  DeleteWorksetSettings |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | DeleteWorksetOption | The current delete workset option. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | WorksetId | The target worksetId for those elements under the deleted workset, which is used for DeleteWorksetOption::MoveElementsToWorkset. |

# See Also

DeleteWorksetSettings Class

Autodesk.Revit.DB Namespace